export const SalahWayData = [
    {
        Text: "تأكد من أن المحيط طاهر وخالي من النجاسات.وهذا يشمل جسدك وملابسك، ومكان الصلاة نفسه. توضأ إن لم تكن على وضوء.فالطهارة شرط من شروط الصلاة، توضأ قبل الصلاة في حالة قيامك بالتبول، التبرز أو أطلقت الغازات أو حدوث نزيف لك أو نمت أو غفوت أو تقيأت أو أُغمى عليك، في كل هذه الأحوال يجب عليك أن تتوضأ مرة أخرى. تأكد من تغطية جميع عوراتك.وهي عند الرجل ما بين السُرة والركبة؛ أما المرأة، جسدها بأكمله، عدا الوجه والكفين. إن كنت تصلي في المسجد، وذلك أفضل، أدخل المسجد بهدوء؛ وذلك حتى لا تزعج غيرك من المصلين قف في مساحة خالية بعيدًا عن باب الدخول أو الخروج من المسجد. في حالة نظافة المنطقة التي ترغب أن تصلي بها، ابسط قطعة من الحصير أو القماش لتستوي الأرض هذه الحصيرة(أو سجادة الصلاة) مهمة جدًا في ثقافة المسلمين.",
    },
    {
        Text: "توجه ناحية القِبلة.القِبلة هي المكان الذي يتوجه إليه المسلمون أثناء الصلاة وهي ناحية الكعبة. المسجد الحرام في مكة يعتبر من أكثر الأماكن قدسية عند المسلمين في جميع أنحاء العالم.تقع الكعبة في وسطه، وينبغي على جميع المسلمين أن يتجهوا ناحية الكعبة خمس مرات يوميًا عند أداء الصلاة.",
    },


    {
        Text: "أداء الصلاة في وقتها. هناك خمس صلوات في أوقات محددة يوميًا، ولكل صلاة وقت محدد يجب أداؤها خلاله، ويتم تحديد هذه الأوقات بواسطة شروق وغروب الشمس. تستغرق الصلاة ما بين 5 إلى 10 دقائق من البداية حتى النهاية. الصلوات الخمس هي الفجر والظهر والعصر والمغرب والعشاء. أما مواقيتها فصلاة الفجر عند وقت الفجر، والظهر بعد الظهر مباشرة، والعصر في فترة ما بعد الظهر، والمغرب عند غروب الشمس، وأخيرا العشاء من مغيب الشفق الأحمر في الليل. لا تؤدى الصلاة يوميًا في نفس الوقت حيث أنها مؤقتة حسب الشمس، والتي يتغير مسارها طوال فصول العام. هذه هي عدد الركعات(أكثر أو أقل) لكل صلاة من الخمس صلوات: الفجر - أ) الركعتين الأولتين سُنة مؤكدة، ب) ركعتين الفرض الظهر - أ) أربعة ركعات سُنة مؤكدة، ب) أربعة ركعات الفرض، ج) ركعتين سُنة مؤكدة، د) ركعتين نافلة(اختيارية ولكنها مفيدة روحيًا) العصر – أ) أربعة ركعات سُنة غير مؤكدة(اختيارية ولكنها مفيدة روحيًا)، ب) أربعة ركعات الفرض المغرب – أ) ثلاثة ركعات الفرض، ب) ركعتين سُنة مؤكدة، ج) ركعتين نافلة(اختيارية ولكنها مفيدة روحيًا) العشاء – أ) أربعة ركعات سُنة غير مؤكدة(اختيارية ولكنها مفيدة روحيًا)، ب) أربعة ركعات الفرض، ج) ركعتين سُنة مؤكدة، د) ركعتين نافلة(اختيارية ولكنها مفيدة روحيًا)، هـ) ثلاثة ركعات واجبة، و) ركعتين نافلة(اختيارية ولكنها مفيدة روحيًا)",
    },
    {
        Text: "استحضر النية في قلبك. قبل بدء الصلاة، يجب أن تفهم وتدرك مفهوم النية، فليس بالضرورة أن تكون النية بصوت عال، ولكنها يجب أن تنبع من القلب. يمكن أن تفكر كم عدد الركعات التي عليك أداؤها ولأي غرض. أيًا يكن، تأكد من صدق النية أولًا.",
    },
    {
        Text: "إرفع يديك مضمومتي الاصابع حتى أذنيك وقُل بصوتٍ معتدل   الله أكبر.افعل هذا أثناء وقوفك.",
    },
    {
        Text: "قم بوضع يدك اليمنى على اليسرى وكلتاهما تحت صدرك واجعل عينيك ناظرة دومًا إلى موضع سجودك. لا تنظر حولك. أقرأ دعاء الاستفتاح في بداية الصلاة: «سُبْحَانَكَ اللَّهُمَ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ» بعد ذلك استعذ بالله بقولك: أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ اتبِع ذلك بقراءة السورة الأولى من القرآن وهي سورة الفاتحة (تُتلى هذه السورة في كل ركعة): بسم الله الرَّحْمَنِ الرَّحِيمِ الحمد لله رب العالمين الرحمن الرحيم مالك يوم الدين إياك نعبد وإياك نستعين اهدنا الصراط المستقيم صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين آمين (ليست من الفاتحة لكن يُسنّ أن تُقال بعدها) ثم تقرأ ماتيسر من أي سورة أخرى من القرآن مثل (سورة الإخلاص): بسم الله الرحمن الرحيم قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوًا أحد",
    },
    {
        Text: "اركع. أثناء الركوع، قل الله أكبر. قم بالانحناء بحيث يكون ظهرك ورقبتك على مستوى أحد في مواجهة الأرض، وعيناك موجهتان نحو الأرض. يجب أن يصنع كل من عينيك وظهرك زاوية مقدارها 90 درجة مع قدميك. وهذا يسمى الركوع. بمجرد الركوع بزاوية صحيحة، قل سبحان ربي العظيم ويكره الاقتصار على واحدة، وأدنى الكمال ثلاث مرات.",
    },

    {
        Text: "قف مرة أخرى (من الركوع). ارفع يديك إلى أذنيك وقل سمع الله لمن حمد. فإذا اعتدلت قائما قل ربنا ولك الحمد. أثناء التلاوة، قم بخفض يديك.",
    },

    {
        Text: "اسجد وضع يديك ورأسك وركبتيك على الأرض. هذا الوضع يسمى السجود. أثناء قيامك بالسجود، قل الله. عند اتخاذ وضعية السجود، قل سبحان ربي الأعلى وبحمده ثلاثة مرات أو عدد فردي من المرات.",
    },

    {
        Text: "قف من السجود واجلس على ركبتيك. ضع قدمك اليسرى من الركبة إلى الكعب على الأرض، في حين يجب أن تكون أصابع قدمك اليمنى فقط على الأرض. ضع يديك في وضع مستوي على ركبتيك. قم بتلاوة ربي اغفر لي وارحمني واجبرني وارفعني وارزقني واهديني وعافني واعفُ عني. اسجد مرة أخرى ثم اتلو سبحان ربي الأعلى وبحمده ثلاثة مرات أو عدد فردي من المرات.",
    },
    {
        Text: "قف من السجدة. قف وقل الله أكبر بهذا أكملت ركعة واحدة بالفعل، وبناء على ميقات الصلاة، عليك أن تكمل ثلاثة ركعات أو أكثر. في الركعة الثانية من كل صلاة، وبعد السجدة الثانية اجلس على ركبتيك وقل التحيات لله والصلوات الطيبات، السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأن محمد رسول الله اللهم صل على محمد وعلى آل محمد. هذا يسمى التشهد.",
    },

    {
        Text: "أنهي الصلاة. بعد التشهد، ثم صلي على النبي اللهم صلي على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد. اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد. ويسن دعاء الله قبل إنهاء الصلاة بهذا الدعاء: أعوذ بالله من عذاب النار وعذاب القبر وفتنة المحيا والممات وفتنة المسيح الدجال (اختياري). أدر رأسك نحو اليمين وقل: السلام عليكم ورحمة الله وبركاته، الملك الذي يسجل الحسنات على يمينك. أدر رأسك نحو اليسار وقل: السلام عليكم ورحمة الله وبركاته، الملك الذي يسجل السيئات على يسارك، وبهذا تنتهي الصلاة!",
    },

]