export const washData = [
    {
        theText: "عقد النية على الوضوء وقل: \"بسم الله\" قبل بدء خطوات الوضوء العملية. النية هي القصد والإرادة وهي مفهوم إسلامي فائق الأهمية في أداء كل العبادات، وبها تُخلص كامل نيتك ومقصدك إلى الله عز وجل. قبل بدء خطوات الوضوء، يفترض بك أن تتمهل للحظة تستجمع فيها كل تركيزك وأفكارك، وتعقد العزم على الإخلاص التام بكل حواسك إلى ما تقوم به (وفي هذه الحالة، أنت تُخلص النية على التركيز في خطوات الوضوء). لا يُجهر بالنية، بل يكون مقرها القلب. ضع كل تركيزك على نطق \"بسم الله\" في بداية الوضوء كأسلوب متبع في صرف ذهنك عن كل مشاغل الحياة والتخلص من أن يكون وضوءك وصلاتك لغير الله عز وجل. يمكنك أن تنطق البسملة جهرًا أو سرًا، وفقًا لما ترتاح إليه أكثر."
    },
    {
        theText: "ابدأ بغسل اليدين. اغسل يدك اليُمنى بيدك اليسرى ثلاث مرات. بعدها، اغسل يدك اليُسرى، بيدك اليمنى، ثلاث مرات. تأكد من الغسل جيدًا بين أصابعك وعلى امتداد المعصمين."
    },
    {
        theText: "تمضمض. املأ كفك الأيمن بالمياه ثم ضعها في فمك للمضمضة ثلاث مرات. أغلق فمك على المياه وانقلها بداخل تجويف الفم عبر الخدين للتأكد من تنظيف المياه جيدًا لفمك، ثم ابصقها."
    },
    {
        theText: "ستنشق المياه عبر أنفك. املأ كف يدك اليمنى بالمياه على مقربة من أنفك؛ استنشق المياه ثم استنثرها ثلاث مرات. نفذ الاستنشاق والاستنثار بحدة وسرعة بغرض التنظيف ودون إدخال كمية كبيرة من المياه عبر أنفك لتجنب دخولها إلى جهازك التنفسي. في حالة عجزك عن استنشاق المياه، اكتفِ بتبليل أصابعك ودعك المنخارين جيدًا لتنظيف أنفك. استخدم مياه نقية وآمنة في الوضوء؛ في بعض المناطق من العالم، قد تحتوي المياه على ما يُعرف باسم 'النيجلرِية الدجاجية' أو 'الأميبا'، والتي يحدث -في حال استنشاقها عبر الأنف لا قدر الله- نوع نادر وقاتل من عدوى الدماغ. المياه الملوثة قد لا تقتصر على المياه من المصادر الطبيعية في الخارج، بل قد تكون مياه الصنابير ملوثة في العديد من الدول الفقيرة، ما يجعل استنشاقها فائق الخطوة. يمكنك تجنب هذا الخطر من خلال مراعاة غلي المياه لمدة دقيقة (3 دقائق في الارتفاعات الأعلى) وتركها تبرد لفترة قبل غسل أنفك بها في الوضوء. [١]"
    },
    {
        theText: "اغسل وجهك. اغسل وجهك ثلاث مرات من خلال توزيع المياه بكفي اليد من الأذن اليمنى لليسرى ومن خط الشعر إلى الذقن."
    },
    {
        theText: "اغسل اليدين من المعصم إلى المرفق دون ترك أي بقعة جافة. اغسل يدك اليمنى، بواسطة كف يدك اليسرى، من الكف إلى المرفق ثلاث مرات، ثم كرر نفس الأمر في يدك اليسرى، بواسطة يدك اليمنى.  في حالة تجبيس اليد أو ربطها برباط ضاغط، يمكنك الاكتفاء بالمسح على الجبيرة فقط. [٢]"
    },
    {
        theText: "اغسل رأسك. يُسمى ذلك بمسح الرأس. مرر يديك المبللتين بلطف فوق أعلى رأسك، من مقدمة الرأس إلى مؤخرتها، ومرة أخرى من مؤخرة الرأس إلى مقدمتها."
    },
    {
        theText: "اغسل الأذنين من الداخل والخارج. ادعك ما وراء الأذن بإبهامك من أسفل لأعلى. تُغسل الأذن بدورها مرة واحدة فقط كذلك."
    },
    {
        theText: "اغسل كلتا قدميك إلى الكعبين. اغسل الكاحلين جيدًا وتأكد من مرور المياه عبر الأصابع. بواسطة إصبعك الخنصر، ادعك الأصابع وما بينها للتخلص من أي أوساخ. ابدأ أولًا بغسل القدم اليمنى، ثم اليسرى، مع تنظيف كل قدم ثلاث مرات."
    },
    {
        theText: "احفظ جيدًا الترتيب سابق الذكر. يجب الوضوء شرعًا بنفس الترتيب المذكور، لذا من المهم أن تحفظه وتتعود عليه خطوة بعد أخرى ومراعاة البدء والانتهاء بنفس النسق لإتمام الوضوء بطريقة صحيحة. في حالة وقوعك في أي خطأ في الترتيب، يجب أن تبدأ الوضوء من أول وجديد."
    },
    {
        theText: "قل دعاء ختم الوضوء بعد الانتهاء. دعاء ختم الوضوء: \"أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدًا عبده ورسوله. اللهم اجعلني من التوابين واجعلني من المتطهرين. سبحانك الله وبحمدك. أشهد أن لا إله إلا أنت. أستغفرك وأتوب إليك.\""
    }
];
